DataProcessors/ТелеграмКомпоновкаСообщенийГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ТелеграмКомпоновкаСообщенийГруппы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПрогрессВыполненияСерверныхПроцедур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ПрогрессВыполненияСерверныхПроцедур</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прогресс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТелеграмКомпоновкаСообщенийГруппы/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СтартНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СкомпоноватьСообщенияГруппыЛинейно(ТелеграмГруппаСообщений, НазваниеГруппы); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
	СтартНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПрогрессНаСервере()
	
	ИндикаторПрогресса = РегистрыСведений.ПрогрессВыполненияСерверныхПроцедур.Получить(Новый Структура("ПолноеИмяОбработчика", "Обработки.ТелеграмКомпоновкаСообщенийГруппы.СкомпоноватьСообщенияГруппыЛинейно")).Прогресс;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрогресс(Команда)
	ОбновитьПрогрессНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрогрессАвтоматически()
	ОбновитьПрогрессНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтартВФонеНаСервере()
	
	МассивСПараметрами = Новый Массив();
	МассивСПараметрами.Добавить(ТелеграмГруппаСообщений);
	МассивСПараметрами.Добавить(НазваниеГруппы);
	ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("Обработки.ТелеграмКомпоновкаСообщенийГруппы.СкомпоноватьСообщенияГруппыЛинейно", МассивСПараметрами);

КонецПроцедуры

&НаКлиенте
Процедура СтартВФоне(Команда)
	СтартВФонеНаСервере();
	ПодключитьОбработчикОжидания("ОбновитьПрогрессАвтоматически", 1, Ложь);
КонецПроцедуры
